import React from 'react'

var Info = () => (
    <div className="info">
        <h3>Інструкція</h3>
        <p>Інструкцію можна прочитати <a target="_blank" rel="noopener noreferrer" href="https://github.com/umbrelluck/db-project/blob/master/README.md">тут</a>.</p>
        <p>A <a href="https://github.com/umbrelluck/db-project" target="_blank" rel="noopener noreferrer">тут</a> можна переглянути код (не треба).</p>
        <h3>Увага</h3>
        <p>Існує певна затримка (до 2-х секунд) між натиском кнопки "GO" та відображенням результату.</p>
        <p> Це пов'язано із надсиланням запиту до сервера, на якому розміщена база даних. </p>
        <p>Тому <b>не потрібно</b> спамити кнопку, ви завжди отримаєте результат запиту.</p>
        <h3>Права то обов'язки</h3>
        <p>Ми розглядаємо себе як ТзОВ (Товариство з Омбеженою Відповідальністю) "team1", адже</p>
        <p>Якщо падає база даних - ми не несемо відповідальність</p>
        <p>Якщо падає цей сайт - ми зробимо все, аби не нести відповідальність, адже хостить це 8-е чудо світу&nbsp;
                <a href="https://www.heroku.com/" target="_blank" rel="noopener noreferrer">Heroku</a> (на правах реклами)</p>
        <p>Якщо запит не повертає результат, або повертає неправильний - ми несемо відповідальність.</p>
        {/* <ul>
            <li>Якщо падає база даних - ми не несемо відповідальності</li>
            <li>Якщо падає цей сайт - ми зробимо все, аби не нести відповідальності, адже хостить це 8-е чудо світу &nbsp;
                <a href="https://www.heroku.com/" target="_blank" rel="noopener noreferrer">Heroku</a> (на правах реклами).</li>
        </ul> */}
    </div>
)

export default Info;